In [1]:
import pandas as pd

## 데이터프레임 연결(concat)
* 2개 이상의 데이터프레임 연결
* **동일한 인덱스 또는 동일한 컬럼 기준**으로 연결  

* `pd.concat(연결할객체리스트)`     
>* 주요 옵션
>    * `axis` : 연결 방향(0:행방향, 1:열방향)
>    * `join` : 인덱스/컬럼 일치 기준(inner:공통부분만 연결, outer:모두연결)
>    * `ignore_index` : 기존 인덱스를 무시할지 여부

### 행 방향으로 연결
* axis=0 (default)

In [2]:
# ----------------------
# 샘플 데이터
# ----------------------

df1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 3], ['d', 4]], columns=['letter', 'number'])
df3 = pd.DataFrame([['e', 5, '!'], ['f', 6, '@']], columns=['letter', 'number', 'etc'])

In [3]:
display(df1)
display(df2)
display(df3)

  letter  number
0      a       1
1      b       2

  letter  number
0      c       3
1      d       4

  letter  number etc
0      e       5   !
1      f       6   @

In [5]:
# ----------------------
# 행방향 concat
# ----------------------
pd.concat([df1,df2,df3])

  letter  number  etc
0      a       1  NaN
1      b       2  NaN
0      c       3  NaN
1      d       4  NaN
0      e       5    !
1      f       6    @

In [6]:
# ----------------------
# 행방향 concat 
# ignore_index
# ----------------------
pd.concat([df1,df2,df3], ignore_index=True)

  letter  number  etc
0      a       1  NaN
1      b       2  NaN
2      c       3  NaN
3      d       4  NaN
4      e       5    !
5      f       6    @

In [10]:
# ----------------------
# 행방향 concat 
# inner join
# ----------------------
pd.concat([df1,df2,df3], ignore_index=True, join='inner')

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4
4      e       5
5      f       6

### 열 방향으로 연결

In [13]:
# ----------------------
# 샘플 데이터
# ----------------------
df4 = pd.DataFrame({'age':[20,21,22]},index = ['amy','james','david'])
df5 = pd.DataFrame({'phone':['010-111-1111','010-222-2222','010-333-3333']},index = ['amy','james','david']
)
df6 = pd.DataFrame({'job':['student','programmer','ceo','designer']},index = ['amy','james','david','J']
)

In [14]:
display(df4)
display(df5)
display(df6)

       age
amy     20
james   21
david   22

              phone
amy    010-111-1111
james  010-222-2222
david  010-333-3333

              job
amy       student
james  programmer
david         ceo
J        designer

In [15]:
# -------------------------
# 열 방향 concat
# -------------------------
pd.concat([df4, df5, df6], axis=1)

        age         phone         job
amy    20.0  010-111-1111     student
james  21.0  010-222-2222  programmer
david  22.0  010-333-3333         ceo
J       NaN           NaN    designer

In [16]:
# -------------------------
# 열 방향 concat
# inner join
# -------------------------
pd.concat([df4, df5, df6], axis=1, join='inner')

       age         phone         job
amy     20  010-111-1111     student
james   21  010-222-2222  programmer
david   22  010-333-3333         ceo